[
{"url": "https://catalogue.fiware.org/enablers/augmented-reality", "text": "What you get \nAugmented Reality Generic Enabler is a high-level application programming interface for HTML5 Augmented Reality applications. Required run-time environment is the JavaScript support of a suitable web browser. No plug-ins are required. These applications may rely on the functionality of the other GEs, like XML3D Technology, POI Data Provider, etc.\n Why to get it \nAR applications will provide additional virtual content on top of the real world surroundings, and enhance the user’s view of the physical world with information that is not directly visible. With the AR GE everything you need to build an AR application is offered through single interface, which makes it easier to develop the application.\n Open Specifications \n Augmented Reality is an implementation of the FIWARE  Augmented Reality  Generic Enabler. \n More specifically, Augmented Reality implements the following APIs and Open Specifications: \n \n FIWARE.OpenSpecification.WebUI.AugmentedReality \n \n", "enabler": "Augmented Reality", "meta": "\n      \n                 \n        Chapter:       Advanced Web-based User Interface      \n        Version:            \n        Updated:       2016-05-23      \n        Contact Person:       Torsten Spieldenner      \n            torsten.spieldenner@dfki.de      \n            Incubated GEs/GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/chapter/applicationsservices-and-data-delivery", "text": "", "enabler": "Applications/Services and Data Delivery", "meta": ""},
{"url": "https://catalogue.fiware.org/enablers/application-mashup-wirecloud", "text": "What you get \n\n Wirecloud builds on cutting-edge end-user development, RIA and semantic technologies to offer a next-generation end-user centred web application mashup platform aimed at leveraging the long tail of the Internet of Services. \n\n Wirecloud builds on cutting-edge end-user (software) development, RIA and semantic technologies to offer a next-generation end-user centred web application mashup platform aimed at allowing end users without programming skills to easily create web applications and dashboards/cockpits (e.g. to visualize their data of interest or to control their domotized home or environment). Web application mashups integrate heterogeneous data, application logic, and UI components (widgets) sourced from the Web to create new coherent and value-adding composite applications. They are targeted at leveraging the \"long tail\" of the Web of Services (a.k.a. the Programmable Web) by exploiting rapid development, DIY, and shareability. They typically serve a specific situational (i.e. immediate, short-lived, customized) need, frequently with high potential for reuse. Is this \"situational\" character which precludes them to be offered as 'off-the-shelf' functionality by solution providers, and therefore creates the need for a tool like Wirecloud \n\n Note:  Wirecloud is at the core of the FIWARE infrastructure and is therefore intended to be installed by FIWARE platform providers when setting up a configuring a new instance of the FIWARE instance node. It is not intended to be deployed/configured by a developer. Developers are encouraged to use  the global instance of Wirecloud provided in the FIWARE Lab . Nevertheless, we provide an installer for stand-alone instances of Wirecloud, along with recipes and blueprints to install it in the Cloud portal (using the PaaS Manager), and the corresponding installation guides. \n\n Why to get it \n\n Web application mashups can be manually developed using conventional web programming technologies (e.g. see http://programmableweb.com). But this fails to take full advantage of the approach. Mashup tools and platforms like Wirecloud aim at development  paradigms that do not require programming skills  and, hence, target end users, being them citizens, knowledge workers, portal designers, etc. \n\n By using Wirecloud you have access to the following key features: \n\n \n Innovate through experimentation by choosing the best suited widgets, operators and prefab mashup-lets for your devised mashup from a vast, ever-growing distributed catalogue  \n\n The wiring editor allows you to easily connect widgets in a mashup to create a full-fledged dashboard with RIA functionality \n\n The piping editor allows you to easily connect widgets to back-end services or data sources through an extendable set of operators, including filters, aggregators, adapters, etc. \n\n Share your newly created mashup with other colleagues and users. Comment it, tag it and rate it to foster discoverability and shareability \n\n Help to build a strong community by commenting, tagging and rating others' widgets, operators and mashups. The platform will also do its best to complement your contribution \n   \n\n More information available at the Wirecloud website:  https://conwet.fi.upm.es/wirecloud", "enabler": "Application Mashup - Wirecloud", "meta": "\n      \n                 \n        Chapter:       Applications/Services and Data Delivery      \n        Version:       5.4.1      \n        Updated:       2016-10-13      \n        Contact Person:       Javier Soriano (UPM)      \n            \nDr. Javier Soriano (jsoriano@fi.upm.es) \nSchool of Computer Science\nUniversidad Politécnica de Madrid\nCampus de Montegancedo s/n\n28660 Boadilla del Monte, Madrid (Spain)\n \n\n Technical questions can be asked in  StackOverflow  using the  fiware-wirecloud  tag      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/chapter/cloud-hosting", "text": "", "enabler": "Cloud Hosting", "meta": ""},
{"url": "https://catalogue.fiware.org/enablers/application-management-murano", "text": "What you get \n The Application Management Service GE - Murano provides the basic support for hardware deployment management (virtual servers, networks...) and software installation management. This includes both the application provisioning phase for as well as the on going life-cycle management of applications. The application management services interacts with the Compute service, Image service, and Network service by using the Orchestrator service in order to management the whole infrastructure.\n\n\nHence, Murano introduces an application catalog to OpenStack, enabling application developers and cloud administrators to publish various cloud-ready applications in a browsable categorized catalog.\nThe main capabilities provided for a cloud hosting user are:\n \n  Application Catalogue, including all the software to be instantiated \n  Deploy of complex application configuration in terms of blueprint templates \n  Support for configuration languages (such as puppet or chef) for the installation of the software \n  Manage life cycle of the application \n \n\n Why to get it \nThe middleware that an application needs to execute their logic can be manually deployed in the cloud. But this is a chronophage and repetitive operation ad eternum. Opposite to it, Murano provides the following advantages:\n \n Cost savings\n    This component helps improve the efficiency of IT resources and processes that form part of application delivery in any enterprise. Murano facilitates the creation of applications and services without the complexity and cost of provisioning the required resources and the management of the traditional application platform stack. Just in a few minutes you can use your applications without have to any infrastructure or configure operation over the needed resources. \n     Faster delivery of applications\n    Murano increases the benefits of Agile Software Development methodologies through the reduction of expended time to deliver software application projects. The architecture of your application is defined once and reused each time that you need to deliver the applications. \n     Increased adaptability\n    Murano reduces the architectural complexity and allows adapting the applications and IT services to answer quickly to new conditions market and organization changes. Any changes on them is translated quickly to the description of your application middleware.  \n", "enabler": "Application Management - Murano", "meta": "\n      \n                 \n        Chapter:       Cloud Hosting      \n        Version:       5.4.3      \n        Updated:       2016-11-03      \n        Contact Person:       Henar Muñoz (Telefónica I+D)      \n            henar.munozfrutos at telefonica dot com      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/support-ranks/fiware-geis", "text": "", "enabler": "FIWARE GEis", "meta": ""},
{"url": "https://catalogue.fiware.org/enablers/3dui-webtundra", "text": "What you get \n\nWebTundra is the Web client for taking realXtend 3D virtual worlds into modern web browsers. The provided TundraSDK and TundraClient can connect to a realXtend Tundra server. Implementing the Tundra network protocol via WebSocket and rendering with WebGL.\n\nFor networked multiuser usage requires a Tundra server (Synchronization GE server side).\n\n Why to get it \n\nDevelop realtime multi-user 3D applications using the realXtend platform, with the Three.js graphics API for WebGL.\n", "enabler": "3DUI - WebTundra", "meta": "\n      \n                 \n        Chapter:       Advanced Web-based User Interface      \n        Version:       5.4.3      \n        Updated:       2016-09-26      \n        Contact Person:       Cvetan Stefanovski      \n            support@meshmoon.com      \n            FIWARE GEis      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/support-ranks/fiware-geris", "text": "", "enabler": "FIWARE GEris", "meta": ""},
{"url": "https://catalogue.fiware.org/enablers/3d-ui-xml3d", "text": "What you get \n\nXML3D is an extension to HTML5 for declarative 3D content represented as a scene graph like structure inside the DOM. All nodes within this graph are also nodes in the web sites DOM tree representation and can be accessed and changed via JavaScript like any other common DOM elements as well. On these DOM nodes, HTML events can be registered similar to known HTML elements. Resources for mesh data can be stored externally in any kind of external format (e.g. JSON, XML or binary) and referenced by URL. XML3D is designed to work efficiently with modern GPUs and Graphics API (such as OpenGL/WebGL) but still tries to stay independent of the rendering algorithm.\n\nIn addition to XML3D, Xflow allows to combine the scene graph with dataflows. Xflow is a declarative data flow representation that was designed for complex computations on XML3D elements. These computations include for example skinned meshes and key frame animations. \n \n \n\n \n Why to get it \n\nIntegrate interactive 3D graphics into your Web-based application! The 3D objects will merge seamlessly with the 2D content and provide the same user experience as common HTML5 elements. Creating 3D scenes does not require any experiences in 3D programming, as they are described in an intuitive HTML-like manner. XML3D offers you:\n \n  Simple and intuitive description of 3D scenes in the Web page\n  Seamless integration with 2D Web page content\n  Intuitive interaction with the 3D scene via HTML events\n \n", "enabler": "3D-UI-XML3D", "meta": "\n      \n                 \n        Chapter:       Advanced Web-based User Interface      \n        Version:       5.1.1      \n        Updated:       2016-04-28      \n        Contact Person:       Christian Schlinkmann      \n            Email: xml3d-public@cg.uni-saarland.de      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/2d3d-capture", "text": "What do you get \n\n2D 3D Capturing is capture contextual information related a 2D 3D scene of the surrounding so that the data can be used to provided to or as services. Location information, lighting information, device orientation, heading direction are the necessary contextual information and based on the service these other information available to the browser can be used. Air pressure, time the image is taken are some of the available important meta data can also be used as \"Tagging content\". Tagging can be similar to the contemparary geo tagging but highly dependent on the image format (JPEG, PNG, ogg, wmv, ect....). Exif extension method can be used if the format used is JPEG and for image formats such as PNG another method can be used. Format of the image in image capture depends on the usage scenario. For example in a situation where image processing is minimal JPEG compresssion can be better over PNG lossless images. \n\n Why to get it \n\nPhotos taken from devices combined with the meta data shown as Tag are transferred to the 2D3D capture server. 2D 3D capture server API then can be used to dig up image based on time, location for use of other applications where 2D or 3D visual information is required. In the use case described here 3D scene builder can be a part of other GEs such as POI. Another use case is, using tagged images published by other services or devices such as Flickr to build a 3d model of the current location so that a person such as lost tourist could find his way. Elaborating on the \"Tag\" and its content, images are geo-tagged in order to improve the user experience in social networks images. 3D information can be used similarly to improve the quality of the user experience and meta data that can be associated with a model improves number of use cases 3d modelling can be used. Most importantly information such as orientation of the device at the moment which the photo is taken can be used to improve the accuracy and it also helps to filter out less useful images from the useful once. In a hypothetical security situation where two images taken from known locations by two security cameras at the same time could be useful in identifying a criminal who happened to be at that location. By using meta data such as lighting conditions the accuracy of the 3d model of the criminal can be improved and will avoid innocent being targeted. \n\n Open specification reference \nThis component has been designed according the  2D/3D Capture GE Open Specification .", "enabler": "2D/3D Capture", "meta": "\n      \n                 \n        Chapter:       Advanced Web-based User Interface      \n        Version:       3.2.3      \n        Updated:       2016-08-31      \n        Contact Person:       Cyberlightning      \n            contact@cyberlightning.com      \n            Deprecated GEis      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/chapter/advanced-web-based-user-interface", "text": "", "enabler": "Advanced Web-based User Interface", "meta": ""},
{"url": "https://catalogue.fiware.org/enablers/2d-ui", "text": "Solving a problem \n HTML-5 and related Web technologies provide the base technology to realize advanced user interfaces. A number of new technologies e.g CSS3 or access to novel input devices via DeviceAPI, provide capabilities previously only available in native user interface toolkits. A key component still missing in HTML is the ability for a Web application to define its own user interface components and reuse them easily as Web Components. The implementation should evaluate, provide, and possibly extend support for the necessary elements to define advanced and highly dynamic user interfaces based on HTML-5, including the ability to define reusable components for common 2D and 3D interaction techniques. The implementation should follow W3C and related standards as much as possible and extend them in suitable ways, where they are inadequate. Any new developments should be contributed back to the relevant standardization bodies. \n\n Goal \n The goal is to provide support for advanced, Web-based, highly dynamic, and potential 3D user interfaces. \n\n What you get \n A javascript library that handles generic web user interface input events like keyboard and mouse.\nThis GE provides means to dynamically add existing input devices input events such as touch pads and gamepad, and input event abstraction to handle keyboard key and mouse button combinations.", "enabler": "2D-UI", "meta": "\n      \n                 \n        Chapter:       Advanced Web-based User Interface      \n        Version:            \n        Updated:       2016-02-10      \n        Contact Person:       Cvetan Stefanovski      \n            You can contact us with email at support@meshmoon.com      \n            Deprecated GEis      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/chapter/security", "text": "", "enabler": "Security", "meta": ""},
{"url": "https://catalogue.fiware.org/support-ranks/deprecated-geis", "text": "", "enabler": "Deprecated GEis", "meta": ""},
{"url": "https://catalogue.fiware.org/enablers/trustworthy-factory", "text": "What you get \n \nYou get the reference implementation of the Trustworthy Factory which help the developer to create trusted applications\nThis is addressed by the Trustworthy Factory GE which thrives on the following major innovations:\n\n \n A trustworthiness-driven (Java) development platform, allowing to instantiate easily the trustworthiness constraints and to produce the related evidence;\n A specific development platform, dedicated to the development of applications for the trustworthy-by-design execution platform;\n A Trustworthy Application Certification Platform supporting certificate editing, signature and binding (code labelling tool). \n \n\n\n Why to get it \nHelping the developer to produce trustworthy application is most for security aspects. Based on Trustworthy attributes (Which are non-functional requirements), the factory help the developer to increase the code quality of his application regarding the trustworthy objectives fixed a the beginning of the project", "enabler": " Trustworthy Factory", "meta": "\n      \n                 \n        Chapter:       Security      \n        Version:       1.0.0.201504231411      \n        Updated:       2016-02-02      \n        Contact Person:       Sebastien Keller      \n            email : sebastien.keller@thalesgroup.com      \n            Deprecated GEis      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/iaas-ge-fiware-reference-implementation", "text": " What you get  \n\nThis GE provides the facilities to provision virtual machines, as well as to associated compute, storage and network resources. The implementation is based on OpenStack -- the rapidly emerging open source project providing cloud infrastructure middleware, being adopted by the wide ecosystem of organizations across the various industry sectors.\n\n  Why should I select/use it  \n\nThis GE provides full automation and extreme ease of use via a self-service interface that can be used to provision and manage ready to use virtual machines with pre-installed general purpose operating system images. It is based on OpenStack -- the leading open source technology, jointly developed and widely used by a rapidly growing community of vendors.\n\n  Access details  \n\nThe preferred way to use this GE is via the  Cloud Portal \n", "enabler": "IaaS GE - FIWARE Reference Implementation", "meta": "\n      \n                 \n        Chapter:       Cloud Hosting      \n        Version:       Kilo      \n        Updated:       2015-11-26      \n        Contact Person:       Kenneth Nagin      \n            NAGIN@il.ibm.com\n      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/support-ranks/fiware-geris?page=3", "text": "", "enabler": "FIWARE GEris", "meta": ""},
{"url": "https://catalogue.fiware.org/chapter/advanced-web-based-user-interface?page=1", "text": "", "enabler": "Advanced Web-based User Interface", "meta": ""},
{"url": "https://catalogue.fiware.org/enablers/security-monitoring", "text": "Advertisement \n This GE deprecated was kept raise awareness of interested parties regarding the features that would be continued through new GE in FIWARE replacong that GE and called Cyber Security. The Cyber Security GE is planned to be release in R4 and as such a dedciated entry would be created on the FIWARE Catalog.\n \n\n What you get \n The Security Monitoring GE is part of the overall Security Management System in FI-WARE and as such is part of each and every FI-WARE instance.  \nThe Security Monitoring GE was designed to be offered as a services suite. The services provided, even if they can be used in isolation offer their most when used conjointly to cover the whole & primary usage pattern. Hereafter is the list of services offered by the Security Monitoring  \n \n MulVAL Attack Paths Engine \n Scored Attack Paths \n Remediation \n \n\n MulVAL Attack Paths Engine \nMulVAL Attack Paths Engine Component is an end-to-end framework and reasoning system that conducts multihost, multistage vulnerability analysis on a network.   MulVAL Attack Paths Engine is accessed using web browser, allowing all users  to generate the attack graphs using the common stream protocol and port (HTTP on port 80).\nAttack graph presents a qualitative view of security discrepancies:\n \n It shows what attacks are possible, but does not tell you how bad the problem is. \n It captures the interactions among all attack possibilities in your system. \n \n\n\n \n\n Scored Attack Paths \nScored Attack Paths represents the next step, following the metrics provided by the MulVAL Attack Paths Engine. Based on the Attack Graph provided by the Mulval Attack Paths Engine, and the individual scores of each step, the objective is to yield the possible attack paths, along with a score associated to each one of the paths.\n\nThe considered attack paths that will be included in the list are selected based on the target node selected in the attack graph. The score of each path reflects the risk associated to the path as a whole, based on the individual scores of each step that have been previously calculated by the MulVAL Attack Paths Engine.\n\nAdditionally to the risk score metric, the score of each path will include a second scoring component that will account for the impact on the processes linked to the IT resource(s) being either\n \n solely at the target node of the attack path \n on the attack path \n \n\nThe main idea of scoring attack paths is to consider paths independently from one another, as opposed to the approach of the MulVAL Attack Paths Engine, composed of individual scores, the latter being computed by taking into account all the connections existing in the attack graph. \n\n\n\n \n\n Remediation \nRemediation provides tools to security operators for proposing cost-sensitive remediations to attack paths.\n\nThe attack paths are shown to a security operator, ordered by their scores, which allow to easily understand the severity of the consequences of the attack paths. To calculate the remediation to the chosen attack path, the tool first extracts the necessary information from the attack path to be corrected. Then, it computes several lists of remediations that could reduce / cut this attack path. Finally, it estimates the cost of each list of remediations and proposes all the lists of remediations, ordered by cost, to security operators. Operators can choose one remediation list and, thanks to the remediation validation, check whether or not the system is more secure after the application of this remediation. \n\nTo compute remediations, a remediation database is needed. It will be external to the GE, as the vulnerability database. This database makes a connection between vulnerabilities (for example thanks to a Common Vulnerabilities and Exposures identifier - CVE ID) and a possible adapted remediation. Several types of remediation could be used, for example a patch (it corrects a vulnerability) or a signature of known attacks (it prevents the exploitation of a vulnerability). To build the remediation database, information about patches can be extracted from publicly available in Security Advisories (for example, coming from CERT-EU or the National Vulnerability Database). Information about signatures and the related vulnerability could be extracted from the signatures database that contains the CVE ID. The last type of remediation provided by the remediation tool can not be stored in the remediation database, because it is a topological remediation. This remediation is providing firewall rules that can prevent the intrusion of the attacker.\n\nTo sort the list of remediations, a cost function is applied to compute an estimate cost of each list. This cost contains two main components: operational costs and impact costs. The operational costs represent the costs caused by the deployment of the remediations, such as:\n\n \n Length of the deployment \n Maintenance \n Tests costs \n \n\nwhereas the impact costs represents the negative impact (side effects) that could happen following a remediation deployment.\n\n\n\n\n\n\n Why to get it \n\nMulVAL Attack Paths Engine is contributing risk management of IT infrastructure.\n\nMuVAL Attack Paths Engine allows you  evaluating the security risk assessment, the potential attack paths and improves the capability to detect security breach and the cyber-resilience of infrastructures.\n\nThe Scored Attack Paths offers an assessment tool that allows users to obtain the attack paths existing in an attack graph, along with their respective individual scores. The score of each attack path allows to assess the risk value and business impact for the target associated to the attack path.\n\nThe Scored Attack Paths is aimed at users who want to either:\n\n \n Utilize the Remediation asset \n Evaluate the situation of their IT infrastructure from the security and business impact viewpoint \n Improve the security configurations through what-if analysis \n \n\nRemediation is aimed at users who want to either:\n\n \n Show attack paths to a security operator \n  Order attack paths by their scores \n Apply a cost function to compute an estimate cost of each list \n \n\n\n Open Specification reference \n\n The Open Specifications of the MulvAL Attack Paths Engine in the context of the Security Monitoring GE can be found via the following links: \n Mulval Attack Paths Engine API Specification \n Mulval Attack Paths Engine  Web Application API Specification \n\n\n The Open Specification of the Scored Attack Paths in the context of the Security Monitoring GE can be found via the following link: \n Scored Attack Paths API Specification \n\n The Open Specification of the Remediation in the context of the Security Monitoring GE can be found via the following link: \n Remediation API Specification \n\n", "enabler": "Security Monitoring", "meta": "\n      \n                 \n        Chapter:       Security      \n        Version:            \n        Updated:       2015-09-02      \n        Contact Person:       Olivier Bettan / Susana González Zarzosa      \n            olivier.bettan@thalesgroup.com\nsusana.gzarzosa@atos.net      \n            Deprecated GEis      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/support-ranks/deprecated-geis?page=1", "text": "", "enabler": "Deprecated GEis", "meta": ""},
{"url": "https://catalogue.fiware.org/enablers/iaas-ge-fiware-reference-implementation/terms-and-conditions", "text": "FIWARE Lab \nDevelopment, testing and experimentation of applications using:\n experimental instances deployed on the FIWARE Lab facilities (see section “Experimental Instances” under the “Instances” tab linked to this entry); or \n  versions of the software downloaded from resources under the “downloads” tab linked to this entry\n\nwill be subject to the terms and conditions to be established in the \"FIWARE Lab: Use Terms and Conditions”.  Any other use is not permitted.\n\n  External availability  \nThe community edition of OpenStack (namely the Nova, Glance, Cinder and Neutron components) available at  GitHub  comprises an open source version of IaaS GE, licensed under Apache V2 license. Moreover, multiple commercial implementations compatible with OpenStack (and hence with IaaS GE) are  available , following different delivery models ( public ,  private ,  hosted private ). Extensions developed in FIWARE are intended for upstream contribution. Usage of experimental enhancements outside of FIWARE Lab and prior to upstreaming is possible by contacting the GE owner, but is not recommended.\n", "enabler": "IaaS GE - FIWARE Reference Implementation", "meta": "\n      \n                 \n        Chapter:       Cloud Hosting      \n        Version:       Kilo      \n        Updated:       2015-11-26      \n        Contact Person:       Kenneth Nagin      \n            NAGIN@il.ibm.com\n      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/iaas-ge-fiware-reference-implementation/instances", "text": "", "enabler": "IaaS GE - FIWARE Reference Implementation", "meta": "\n      \n                 \n        Chapter:       Cloud Hosting      \n        Version:       Kilo      \n        Updated:       2015-11-26      \n        Contact Person:       Kenneth Nagin      \n            NAGIN@il.ibm.com\n      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/poi-data-provider", "text": "What you get \nPOI (Points of interest) Generic Enabler is a web server kit that supports\n \n storing information related to locations \n serving queries by location and other criteria \n can be configured to meet your data needs \n \n\n \n\n Why to get it \n\nPOI Generic Enabler makes it relatively easy to\n \n Relate any information to places, e.g. \n  \n  Tourist attractions / services \n  Photos, videos, 3D content \n  Special location data of your business \n  Imaginary items of an outdoor game \n  ... \n  \n Search information by location and other criteria \n Store information by location \n Develop an application that utilizes those capabilities \n \n Open Specifications \n POI Data Provider is an implementation of the FIWARE  POI Data Provider Generic Enabler  Generic Enabler. \nMore specifically, POI Data Provider implements the following APIs and Open Specifications:\n \n FIWARE.OpenSpecification.MiWi.POIDataProvider \n \n .\n Source Code \n POI_Data_Provider in GitHub", "enabler": "POI Data Provider", "meta": "\n      \n                 \n        Chapter:       Advanced Web-based User Interface      \n        Version:       5.4      \n        Updated:       2016-09-19      \n        Contact Person:       Ari Okkonen      \n            ari.okkonen@adminotech.com      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/security-monitoring/terms-and-conditions", "text": "MulVAL Attack Paths Engine  \n\n FI-LAB (Open Innovation Lab) \n \nDevelopment, testing and experimentation of applications using:\n•\texperimental instances deployed on the FI-WARE  FI-LAB (Open Innovation Lab) facilities (see section “Experimental Instances” under the “Instances” tab linked to this entry); or \n•\tversions of the software downloaded from resources under the “downloads” tab linked to this entry is subject to the terms and conditions established in the “FI-WARE FI-LAB (Open Innovation Lab): Use Terms and Conditions” \"http://forge.fi-ware.org/plugins/mediawiki/wiki/fiware/index.php/FI-WARE_Open_Innovation_Lab:_Use_Terms_and_Conditions\".   Any other use is not permitted.\n \n\n External availability \n \nSoftware associated to MulVAL Attack Paths Engine  is  provided as open source under AGPLv3.\n\nPlease note that software derived as a result of modifying the source code of the MulVAL Attack Paths Engine product software in order to fix a bug or incorporate enhancements is considered a derivative work of the product. Software that merely uses or aggregates (i.e. links to) an otherwise unmodified version of existing software is not considered a derivative work.\n \n\n\n Scored Attack Paths \n\n\n FI-LAB (Open Innovation Lab) \n \nDevelopment, testing and experimentation of applications using:\n•\texperimental instances deployed on the FI-WARE FI-LAB (Open Innovation Lab) facilities (see section “Experimental Instances” under the “Instances” tab linked to this entry); or \n•\tversions of the software downloaded from resources under the “downloads” tab linked to this entry is subject to the terms and conditions established in the “FI-WARE FI-LAB (Open Innovation Lab): Use Terms and Conditions” \"http://forge.fi-ware.org/plugins/mediawiki/wiki/fiware/index.php/FI-WARE_Open_Innovation_Lab:_Use_Terms_and_Conditions\".   Any other use is not permitted.\n \n\n External availability \n \nSoftware associated to Scored Attack Paths is provided as open source under AGPLv3.\n\nPlease note that software derived as a result of modifying the source code of the Scored Attack Paths product software in order to fix a bug or incorporate enhancements is considered a derivative work of the product. Software that merely uses or aggregates (i.e. links to) an otherwise unmodified version of existing software is not considered a derivative work.\n \n\n\n\n\n Remediation  \n\n FI-LAB (Open Innovation Lab) \n \nDevelopment, testing and experimentation of applications using:\n•\texperimental instances deployed on the FI-WARE FI-LAB (Open Innovation Lab) facilities (see section “Experimental Instances” under the “Instances” tab linked to this entry); or \n•\tversions of the software downloaded from resources under the “downloads” tab linked to this entry is subject to the terms and conditions established in the “FI-WARE Open Innovation Lab: Use Terms and Conditions” \"http://forge.fi-ware.eu/plugins/mediawiki/wiki/fiware/index.php/FI-WARE_Open_Innovation_Lab:_Use_Terms_and_Conditions\".   Any other use is not permitted.\n \n\n External availability \n \nSoftware associated to the Remediation is provided as open source under AGPLv3.\n\nPlease note that software derived as a result of modifying the source code of the Remediation product software in order to fix a bug or incorporate enhancements is considered a derivative work of the product. Software that merely uses or aggregates (i.e. links to) an otherwise unmodified version of existing software is not considered a derivative work.\n \n\n", "enabler": "Security Monitoring", "meta": "\n      \n                 \n        Chapter:       Security      \n        Version:            \n        Updated:       2015-09-02      \n        Contact Person:       Olivier Bettan / Susana González Zarzosa      \n            olivier.bettan@thalesgroup.com\nsusana.gzarzosa@atos.net      \n            Deprecated GEis      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/security-monitoring/instances", "text": "", "enabler": "Security Monitoring", "meta": "\n      \n                 \n        Chapter:       Security      \n        Version:            \n        Updated:       2015-09-02      \n        Contact Person:       Olivier Bettan / Susana González Zarzosa      \n            olivier.bettan@thalesgroup.com\nsusana.gzarzosa@atos.net      \n            Deprecated GEis      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/iot-discovery", "text": "What you get \nThis is reference implementation for IoT Discovery GE. \n\nIts role is to act as a meeting point for IoT Context Producers to register the availability of their Things and Sensor devices, and IoT Context Consumers to discover them, using either the OMA NGSI-9 messaging protocol – a simple but powerful API for contextual information exchange.\nFor semantic users, the Sense2Web API can be used which supports Linked Open Data.\n \nThe API exposes two main modules:\n \n \n NGSI-9 Server \n Sense2Web Linked-data platform \n \n NGSI-9 Server \n \nThe server provides a repository for the storage of NGSI entities and allows NGSI-9 clients to:\n \n \n Register context information about Sensors and Things. \n Discover context information using ID, attribute, attribute domain, and entity type. \n \nNGSI-9 clients include other FIWARE GEs, such as the Data Handling GE and the Device Management GE for registration, and the IoT Broker for discovery.\n \n Sense2Web \n \nA platform which provides a semantic repository for IoT providers to register and manage semantic descriptions (in RDF/OWL) about their \"Things\", whether they be Sensor/Actuator Devices, virtual computational elements (e.g. data aggregators) or virtual representations of any Physical Entity.\n \nIn turn, it provides IoT Users to discover these registered IoT elements using:\n \n \n retrieve descriptions in RDF \n A probabilistic search mechanism that provides recommended and ranked search results for queries that don’t provide exact matching property values. \n Semantic querying via SPARQL \n An association mechanism that associates Things and sensors based on their shared attribute (e.g. temperature) and spatial proximity, which can then be queried via SPARQL. \n \n \nThe platform currently supports IoT Descriptions based on the IoT-A Project (http://iot-a.eu), but can be extended to support other types.\n \nA Web User interface is provided for users to create, read, update and delete (CRUD) semantically-annotated IoT Descriptions, and also link them to other Linked Open Data (LOD) resources on the Web.\n \n Why you get \nThe primary purpose is to allow context producers to register their IoT Objects in linked-data format, and in turn allow context consumers to discover them using a set of search techniques. ", "enabler": "IoT Discovery", "meta": "\n      \n                 \n        Chapter:       Internet of Things Services Enablement      \n        Version:       Release 5      \n        Updated:       2016-10-26      \n        Contact Person:       Tarek Elsaleh      \n            t.elsaleh@surrey.ac.uk\n\n      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/iot-data-edge-consolidation-ge-cepheus", "text": "What you get \n \nThe IoT Data Edge Consolidation (IDEC) GE addresses the need to process data in real time. Frequently implemented features include filtering, aggregating and merging real-time data from different sources. Thanks to Complex Event Processing (CEP), it is easy for applications to only subscribe to value-added data which is relevant to them. CEP technology is sometimes also referred to as event stream analysis, or real time event correlation.\n \n\n \n   Cepheus  is divided in two simple deployable applications. The first one is a light NGSI broker which features an implementation of  the standardized NGSI API . And a CEP which features a dedicated REST management API to configure real time analysis on NGSI events. \n \n\n \n  More information can be found  on the github page. \n \n\nRelated assets\n \n   \n     Esper (by EsperTech) library      \n   \n \n Why to get it \n \n  IoT Data Edge Consolidation GE is designed to provide a common access in real time to all data, for any kind of sensors and \"Things\". Using a lightweight storage system, this enabler can save and locally store relevant processed data, as close as possible possible to the processed entities. It targets IoT gateways and embedded systems.\n \n \n  IoT Data Edge Consolidation GE is the first stage of intelligence, filtering and aggregating sensor events thanks to smart but simple rules. It collects NGSI data in real-time from compliant IoT protocol adapters, transform them to value-added application relevant events, then finally propagate them towards the subscribers. Subscribed applications are now able to collect filtered-relevant real-time data, thus externalizing the responsibility for dedicated development of asynchronous data analysis. CEP processing rules are described in a SQL-like language, they are completely dynamic and as such they can be updated or deleted on-the-fly.\n \n \n  One of the key components of IoT Data Edge Consolidation GE is Esper (by EsperTech), an open-source event processing java library. Although IoT Data Edge Consolidation GE can perform well on the server side, it mainly targets hardware-constrained environments like embedded boards, SME boxes and gateways, high-end sensors, various mobile devices and so on...\n", "enabler": "IoT Data Edge Consolidation GE - Cepheus", "meta": "\n      \n                 \n        Chapter:       Internet of Things Services Enablement      \n        Version:       0.1.6      \n        Updated:       2016-10-21      \n        Contact Person:       Ask in Stack Overflow with tag fiware      \n            fiware.d4m@orange.com      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n            \n Cepheus \n \n   \n     \n       criteria \n       value \n       label \n     \n   \n   \n     \n       The overall label is the average of all individual labels assessed by Sep 2016  \n     \n   \n   \n     \n       Documentation completeness \n       Excellent \n       A+++ \n     \n     \n       Documentation soundness \n       Very Good \n       A++ \n     \n     \n       APIs Failure Rate \n       0 tests failed/executed \n       A+++ \n     \n     \n       Detected defects by Priority \n       0 average bugs priority \n       A+++ \n     \n     \n       Time to respond issues \n       < 1 day \n       A+++ \n     \n     \n       Time to fix issues \n       < 1 day \n       A+++ \n     \n     \n       Scalability \n       1,02 response time/thread number \n       A+++ \n     \n     \n       Performance \n       200 updates/sec \n       A+++ \n     \n     \n       Stability \n       Memory leak avoidable by configuration \n       B \n     \n   \n \n      "},
{"url": "https://catalogue.fiware.org/enablers/iot-broker", "text": "What you get \n\nThe  IoT Broker Generic Enabler  is specified as a lightweight and scalable middleware component that separates IoT applications from the underlying device installations. The  IoT Broker  implementation available through the FIWARE Catalogue is the reference implementation of this Generic Enabler by NEC. This implementation satisfies all properties described in the specification of the Generic Enabler.\n\nThe IoT Broker has unique properties that you will not find in other IoT Platforms:\n\n \n  While the IoT Broker GE decouples applications from underlying IoT device installations, it achieves this going far beyond the common publish/subscribe paradigm. Instead, the IoT Broker actively communicates simultaneously with large quantities IoT gateways and devices in order to obtain exactly the information that is required by the running IoT applications. As a result, information only is generated and exchanged when needed. This is in contrast to the state-of-the-art middleware components where any piece of information - whether needed or not - is just ''dumped'' inside a central repository.\n  The IoT Broker has the ability to automatically translate information to the right abstraction level and therefore closes the gap between information-centric applications and device-centric IoT installations. For example, a simple device can typically only deliver values without being aware of the meaning of these values in the application's context. On the other hand, IoT applications have to written without consideration of the device installations in order to be applicable in more than one specific environment. This gap is closed by the IoT Broker by the use of so-called  associations  between device-level and thing-level information.\n \n\nThe IoT Broker Generic Enabler is based on the simple and powerful information model standardized in  OMA Next Generation Service Interface Context Enabler (NGSI 9 / NGSI 10) . This API has emerged in FIWARE as an important open standard of information exchange, implemented by a considerable number of FIWARE GEs. In NGSI 9/10, all objects of the real world, being it sensor/actuator devices or arbitrary objects (like tables, rooms, cars, ...) are represented as so-called Context Entities, while information about these objects is expressed in the form of  attributes . For more information about the OMA NGSI 9/10 information model and the related interfaces, please refer to the  Open API Specification .\n\n Why to get it \n\nThe main features of this Enabler are \n Offering a  single point of contact  to the user, hiding the complexity of the multi-provider nature of the Internet of Things. \n Collecting  and aggregating information about thousands of real-world objects on behalf of the user. \n Provide means to  assemble lower-level device information  (device-centric access)  into higher-level Thing information  (information-centric access). \n", "enabler": "IoT Broker", "meta": "\n      \n                 \n        Chapter:       Internet of Things Services Enablement      \n        Version:       5.4.3      \n        Updated:       2016-10-21      \n        Contact Person:       Stefan Gessler, Flavio Cirillo      \n            iotplatform at neclab dot eu\n      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n            \n Iot Broker \n \n   \n     \n       criteria \n       value \n       label \n     \n   \n   \n     \n       The overall label is the average of all individual labels assessed by Sep 2016  \n     \n   \n   \n     \n       Documentation completeness \n       Good \n       A+ \n     \n     \n       Documentation soundness \n       Good \n       A+ \n     \n     \n       APIs Failure Rate \n       0,07 tests failed/executed \n       A++ \n     \n     \n       Detected defects by Priority \n       2 average bugs priority \n       A \n     \n     \n       Time to respond issues \n       5,6 days \n       A+ \n     \n     \n       Time to fix issues \n       16,4 days \n       C \n     \n     \n       Scalability \n       1,15 response time/thread number \n       A++ \n     \n     \n       Performance \n       388,95 updates/sec \n       B \n     \n     \n       Stability \n       Memory/CPU are progressively increasing but no leak \n       A \n     \n   \n \n      "},
{"url": "https://catalogue.fiware.org/enablers/fast-rtps", "text": "What you get \n Fast RTPS is a high performance publish subscribe framework developed by eProsima to share data in distributed systems using a decoupled model based on Publishers, Subscribers and Data Topics. \n\n eProsima Fast RTPS is striking fast, beating alternatives such as ZeroMQ and other pubsub middleware in both windows and linux. \n\n Fast RTPS has been adopted by many customers, especially in the Robotic market, and powers the next version of ROS (Robot Operating System), de facto standard Robotics Framework.  \n\n The framework generates the Publish/Subscribe code from the topic definition using an Interface Definition Language (IDL) allowing the developer focus in his application logic without bothering about the networking details. \n\n eProsima Fast RTPS is free software (Apache License 2.0) with commercial support available, and built onto standards: Fast RTPS is a standalone Cpp implementation of the OMG (Object Management Group) RTPS (Real Time Publish Subscribe) wire protocol. \n\n Why to get it \n Implement transparent, fast, secure and standard conform communication between applications or services using a friendly and extendable Application Programming interface (API). \n\n Open specification \n\n", "enabler": "Fast RTPS", "meta": "\n      \n                 \n        Chapter:       Advanced middleware and interfaces to Network and Devices      \n        Version:       1.3.0      \n        Updated:       2016-09-27      \n        Contact Person:       Jaime Martin Losa      \n            JaimeMartin@eProsima.com\n+34 607 91 37 45\n      \n            Incubated GEs/GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/security-monitoring/downloads", "text": "", "enabler": "Security Monitoring", "meta": "\n      \n                 \n        Chapter:       Security      \n        Version:            \n        Updated:       2015-09-02      \n        Contact Person:       Olivier Bettan / Susana González Zarzosa      \n            olivier.bettan@thalesgroup.com\nsusana.gzarzosa@atos.net      \n            Deprecated GEis      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/security-monitoring/documentation", "text": "  MulVAL Attack Paths Engine \n\n Quick reference guide \n\nThe Attack Paths Engine is an end-to-end framework and reasoning system that conducts multihost, multistage vulnerability analysis on a network. \nAttack Path Engine comprises a scanner—run asynchronously on each host and which adapts existing tools such as Nessus to a great extent—and an analyzer, run on one host whenever new information arrives from the scanners. \n\n \n Step 1 \n  \nAs the first step, click the link http://secmonitoring.testbed.fi-ware.org/AttackGraphEngine/attackgraph.jsp to launch the application.\n\n \n Step 2 \n \nBrowse in your local folders in order to get Nessus and Topology files. Firstly you start to get the Nessus file and secondly you get the topology file. \n\nYou will see an example of file to be downloaded by clicking the link http://catalogue.fi-ware.org/sites/default/files/inputs_for_attackgraph_global_demo.zip\n\n \n Step 3 \n \nOnce your Nessus and topology files selected, click on Upload files. \nThese files will be uploaded to server and will be processed by Attack Path Engine. \nThe results are sending back directly on the browser.\n\nWhen you click on the first link, you can dispay the PDF file directly on your web browser. \n\nWhen you click on the second link, you can dispay the XML file directly on your web browser. For the integration, you can save as this file in order to add value for your business.\n\n \n Manuals  \n  \n \n A high-level description of the overall architecture of the MulVAL Attack Paths Engine in the Security Monitoring GE is available at the  Architecture Description \n\n The description of the MulVAL Attack Paths Engine provided in the Security Monitoring GE is available at the  MulVAL Attack Paths Engine Description \n\n The provided API of the MulVAL Attack Paths Engine is specified in the  API Specification  and the Web Application is specified in the  Web Application API Specification \n\n The installation and administration guide of  MulVAL Attack Paths Engine is provided in the  Installation and Administration Guide  and the Web Application is provided in the  Web Application Installation and Administration Guide \n\n\n \n Tutorials       \n\n\n The user and programmer guide of MulVAL Attack Paths Engine is provided in the  User and Programmer Guide  and the Web Application is provided in the  Web Application User and Programmer Guide \n\n The tutorial to test the MulVAL Attack Paths Engine is provided in the  Unit Testing Plan  and the tutorial to test the Web Application is provided in the  Web Application Unit Testing Plan \n\n\n  Scored Attack Paths \n\n Quick reference guide \n\nThe scoring application provides tools to security operators for assessing the risk and impact of attack paths. This application is written in Java and has a client interface provided by Swing Java library. This quick guide explains how to use this application. \n\n \n Step 1 \n  \nThe main view contains the controls necessary for operating the application, setting the parameters, chosing the desired functions, and obtaining the attack path scores.\n\n \n Step 2 \n \nNext to the main control panel view, can be seen a tree view of the Attack Graph XML file. This view provides in a succint manner the details of the data format, allowing therefore to easily access the data related to a given vertex or an arc. \n\n \n Step 3 \n \nThe user inputs a new attack graph file, by clicking on the 'New input file to database'. An dialog opens for the MulVAL file selection, as depicted in the Figure below. \n \n\n \n Step 4 \n \nOnce the file has been selected, the user must load it by means of the 'Load current database' button. A dialog confirms whether the operation succeeded or failed\n\n \n Step 5 \n \nIf a file needs to be discarded, the database needs to be reinitialized. In order to do this, the user employs the 'Reset current database'.\n\n \n Step 6 \n \nAfter having input the MulVAL file, and loaded the XML database of the file, the user needs to select the normalization method, the score formula, and simply click on the 'Score' button.\n\n \n Manuals  \n  \n A high-level description of the overall architecture of the Scored Attack Paths in the Security Monitoring GE is available at the  Architecture Description \n The description of the Scored Attack Paths provided in the Security Monitoring GE is available at the  Scored Attack Paths Description \n\n The provided API of the Scored Attack Paths is specified in the  API Specification \n The installation and administration guide of Scored Attack Paths is provided in the  Installation and Administration Guide \n\n\n \n Tutorials       \n\n\n The user and programmer guide of Scored Attack Paths is provided in the  User and Programmer Guide \n The tutorial to test the Scored Attack Paths is provided in the  Unit Testing Plan \n\n\n\n\n\n\n\n  Remediation \n\n Quick reference guide \n\nThe remediation application provides tools to security operators for proposing cost-sensitive remediations to attack paths. This application is written in Java and has a web-interface provided by the Vaadin library. This quick guide explains how to use this web application. \n\n \n Step 1 \n  \nAttack path view:\n\nThe main view contains a representation of the attack path to correct. The first attack path printed is the first ranked (according to the attack paths ranking function). The user can choose another attack path to print in a combo box. The vertices of the attack path have different colours, according to the type of vertex (OR, AND, LEAF or GOAL). The labels of the vertices explain the type of action made by the attacker. A more detailed caption can be found by clicking the \"Show caption\" button under the attack path view. \n\n \n Step 2 \n \nAttack path topologic view:\n\nNext to the attack path view, can be seen a more abstracted and topologic view of the attack path. This view show the different access made by the attacker accross the information system during the attack. This view also show the target machine of the attack and all the compromised machines.\n\n \n Step 3 \n \nRemediation choice:\n\nOn the bottom of the GUI, the security operator can choice several sets of remediation that can correct the attack path. The remediation set with the lower cost is chosen by default, but the operator can choose another one with the appropriate combo-box. To simulate the application of a remediation and its effects on the attack path, the operator can click on the related checkbox and then reset the applied remediations with the button \"Reset remediations\".\n \n \n Manuals  \n  \n A high-level description of the overall architecture of the Remediation in the Security Monitoring GE is available at the  Architecture Description \n The description of the Remediation provided in the Security Monitoring GE is available at the  Remediation Description \n The provided API of the Remediation is specified in the  API Specification \n The installation and administration guide of the Remediation is provided in the  Installation and Administration Guide \n\n\n \n Tutorials       \n\n\n The user and programmer guide of the Remediation is provided in the  User and Programmer Guide \n The tutorial to test the Remediation is provided in the  Unit Testing Plan \n\n\n", "enabler": "Security Monitoring", "meta": "\n      \n                 \n        Chapter:       Security      \n        Version:            \n        Updated:       2015-09-02      \n        Contact Person:       Olivier Bettan / Susana González Zarzosa      \n            olivier.bettan@thalesgroup.com\nsusana.gzarzosa@atos.net      \n            Deprecated GEis      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/poi-data-provider/terms-and-conditions", "text": "Experimentation/testing within the scope of the FIWARE PPP \n Projects being part of the FIWARE PPP program can use the POI Data Provider Generic Enabler product under the conditions established in the FIWARE PPP Collaboration Agreement that they should have signed as beneficiaries of the program. \n FIWARE Lab \n Development, testing and experimentation of applications using:\n \n experimental instances deployed on the FIWARE Lab facilities (see section \"Experimental Instances\" under the \"Instances\" tab linked to this entry); or \n versions of the software downloaded from resources under the \"downloads\" tab linked to this entry \n \nis subject to the terms and conditions established in the \" FIWARE Lab Terms and Conditions \". Any other use is not permitted.\n External Availability \n Software associated to the POI Data Provider Generic Enabler product is provided as open source under  Apache License 2.0 . \n", "enabler": "POI Data Provider", "meta": "\n      \n                 \n        Chapter:       Advanced Web-based User Interface      \n        Version:       5.4      \n        Updated:       2016-09-19      \n        Contact Person:       Ari Okkonen      \n            ari.okkonen@adminotech.com      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/poi-data-provider/instances", "text": "", "enabler": "POI Data Provider", "meta": "\n      \n                 \n        Chapter:       Advanced Web-based User Interface      \n        Version:       5.4      \n        Updated:       2016-09-19      \n        Contact Person:       Ari Okkonen      \n            ari.okkonen@adminotech.com      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/iot-discovery/terms-and-conditions", "text": "FIWARE Lab \nDevelopment, testing and experimentation of applications using:\n \n experimental instances deployed on the FIWARE Lab facilities (see section “Experimental Instances” under the “Instances” tab linked to this entry); or \n versions of the software downloaded from resources under the “downloads” tab linked to this entry \n \nis subject to the terms and conditions established in the  “FIWARE Lab: Use Terms and Conditions” . Any other use is not permitted.\n \n External availability \nSoftware associated to the IoT Discovery product is provided as open source under the GNU Affero General Public License, Version 3 (AGPL-3.0). Please check the specific terms and conditions linked to this open source license at  the source repository  site .\nPlease note that software derived as a result of modifying the source code of the IoT Discovery product software in order to fix a bug or incorporate enhancements is considered a derivative work of the product. Software that merely uses or aggregates (i.e. links to) an otherwise unmodified version of existing software is not considered a derivative work).", "enabler": "IoT Discovery", "meta": "\n      \n                 \n        Chapter:       Internet of Things Services Enablement      \n        Version:       Release 5      \n        Updated:       2016-10-26      \n        Contact Person:       Tarek Elsaleh      \n            t.elsaleh@surrey.ac.uk\n\n      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/fast-rtps/terms-and-conditions", "text": "Fast RTPS is provided as open source under Apache 2.0 license.  Please check the specific terms and conditions linked to this open source license at  http://www.apache.org/licenses/ .", "enabler": "Fast RTPS", "meta": "\n      \n                 \n        Chapter:       Advanced middleware and interfaces to Network and Devices      \n        Version:       1.3.0      \n        Updated:       2016-09-27      \n        Contact Person:       Jaime Martin Losa      \n            JaimeMartin@eProsima.com\n+34 607 91 37 45\n      \n            Incubated GEs/GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/fast-rtps/instances", "text": "", "enabler": "Fast RTPS", "meta": "\n      \n                 \n        Chapter:       Advanced middleware and interfaces to Network and Devices      \n        Version:       1.3.0      \n        Updated:       2016-09-27      \n        Contact Person:       Jaime Martin Losa      \n            JaimeMartin@eProsima.com\n+34 607 91 37 45\n      \n            Incubated GEs/GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/fast-rtps/downloads", "text": "", "enabler": "Fast RTPS", "meta": "\n      \n                 \n        Chapter:       Advanced middleware and interfaces to Network and Devices      \n        Version:       1.3.0      \n        Updated:       2016-09-27      \n        Contact Person:       Jaime Martin Losa      \n            JaimeMartin@eProsima.com\n+34 607 91 37 45\n      \n            Incubated GEs/GEris      \n        Feedback:       Send feedback      \n                 "},
{"url": "https://catalogue.fiware.org/enablers/stream-oriented-kurento", "text": "What you get \n\nThe Stream Oriented GE is a development framework that provides an abstraction layer for multimedia capabilities, allowing non-expert developers to include interactive media components to their applications. At the heart of this enabler there is the Open API. A REST-like API, based on JSON RPC 2.0, exposing a toolbox of Media Elements that can be chained to create complex media processing pipelines.\n\nThe Stream Oriented GE provides several client implementations of the Open API. The Java client allows developers to include media capabilities to Java or JEE applications. There is also a Javascript client ready to be used with NodeJS or directly in browser applications.\n\nThanks to these, the Stream Oriented GE provides developers with a set of robust end-to-end interoperable multimedia communication capabilities to deal with the complexity of transport, encoding/decoding, processing and rendering tasks in an easy and efficient way. \n\n Why get it \n\nThe development of interactive multimedia applications is a complex task, which usually requires specific expertise and huge investments. Stream Oriented GE brings a number of abstractions and enablers democratizing multimedia technologies and making possible to any WWW developer to create powerful applications involving advanced features such as: interoperable audiovisual communications, computer vision, augmented reality, flexible media playing, recording, etc.\n\nThe Stream Oriented GE will be particularly useful and intuitive for developers familiar with Java EE and JavaScript technologies, although its capabilities are also exposed through agnostic interoperable network interfaces that can be consumed from any other language of system.\n\nIn a nutshell, It makes possible the development of complex interactive multimedia communications in a fast, simple and easy way.\n\n Open Specifications \n\nKurento is an implementation of the FIWARE  Stream Oriented Generic Enabler  . More specifically, Kurento implements the  Stream Oriented Open API Specification  and provides  Java and Javascript client implementations to access media capabilities \n", "enabler": "Stream-oriented - Kurento", "meta": "\n      \n                 \n        Chapter:       Data/Context Management      \n        Version:       6.6.0      \n        Updated:       2016-10-21      \n        Contact Person:       Luis López      \n            luis.lopez@urjc.es\n      \n            FIWARE GEris      \n        Feedback:       Send feedback      \n            \n \n   \n     \n       criteria \n       value \n       label \n     \n   \n   